/**
 * @file MovieCamera.cpp
 * @brief OwnerActor中心に、決まった動きをするカメラ
 * @author suzuki.shunsuke
 * @date 2022/02/02
 */
#include "pch.h"
#include "MovieCamera.h"

 //=====================================================
 //		コンストラクタ
 //=====================================================
MovieCamera::MovieCamera(Actor* pOwner)
	:MyCamera(pOwner)
{
}

//=====================================================
//		デストラクタ
//=====================================================
MovieCamera::~MovieCamera()
{
}

//=====================================================
//		更新
//=====================================================
void MovieCamera::Update()
{
}
